SIMISA@@@@@@@@@@JINX0D0t______
 
Wagon ( CH_34043_CoombeMartin
    Type ( Engine )
    WagonShape ( CH_34043_CoombeMartin.s )
    Size  ( 2.614m 3.87m 13.9652m )
FreightAnim ( "WC_crew.s"  1 1 )
    CentreOfGravity ( 0m 1.5m 0m )
    Centre ( 0m 0m 0m )
    Mass       ( 87.38t )
    InertiaTensor ( Box(2.614m 3.87m 13.9652m) )
 Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 1e7N/m 1e7N/m )
			Damping ( 0.2e7m/s 0.2e7m/s )
			Break ( 6e7N 6e7N )
			r0 ( 10cm 1e9 )
		)
		CouplingHasRigidConnection ()
		Velocity (0.1m/s)
	)

	Coupling (
		Type ( Automatic)
		Spring (
			Stiffness ( 1e6N/m 2e6N/m )
			Damping ( 1e6N/m/s 1e6N/m/s )
			Break ( 6e7N 6e7N )
			r0 ( 20cm 40cm )
		)
	)
	Buffers (
		Spring (
			Stiffness ( 1e6N/m 5e6N/m )
			Damping ( 1e6N/m/s 1e6N/m/s )
			r0 ( 0cm 1e9 )
		)
		Centre ( 1.5 )
		Radius ( 1 )
		Angle ( 2.5deg )
	)
 
    Adheasion ( 0.1375 0.27 1.8 0 )
    DerailRailHeight ( 10cm )
    DerailRailForce ( 240kN )
    DerailBufferForce ( 400kN )
    WheelRadius ( 0.48m )
    NumWheels ( 1 )
    Friction (
	7258.3N/m/s    0.25    5.4mph    9.927N/m/s    1.881
	1.875
		5.1N/rad/s		1		-1rad/s		0		1
	)
    
    BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
    BrakeSystemType ( "Vacuum_single_pipe" )
    MaxBrakeForce( 43kN )
 
    MaxHandbrakeForce( 30kN )
    NumberOfHandbrakeLeverSteps ( 100 )
 
        MaxReleaseRate ( 10 )
        MaxApplicationRate ( 10 )
        MaxAuxilaryChargingRate ( 10 )
        BrakeCylinderPressureForMaxBrakeBrakeForce ( 21 )
 
       Sound ("..\\..\\common.sound\\Bullied_LightPacific\\blp-eng01.sms" )
 
       Lights ( 5
   Light (
    comment( Cab Effects )
    Type  ( 0 )
    Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle ( 0 )
    States ( 2
     State (
      Duration ( 0.05 )
      LightColour ( ACFF7200 )
      Position ( -0 2.3 -4.9 )
      Azimuth ( -180 -180 -180 )
      Transition ( 0 )
      Radius ( 1.4 )
      )
     State (
      Duration ( 0.05 )
      LightColour ( 80FFE610 )
      Position ( -0 2.3 -4.9 )
      Azimuth ( -180 -180 -180 )
      Transition ( 0 )
      Radius ( 1.4 )
          
     )
    )
    )
   Light (
    comment( Sphere of light )
     Type  ( 1 )
     Conditions (
     Headlight ( 3 )
     Unit ( 2 )
    )
     Cycle  ( 0 )
     FadeIn ( 0.5 )
     FadeOut ( 0.5 )
     States ( 1
     State (
      Duration ( 0.0 )
      LightColour ( FFFFFFFF )
      Position ( 0 2.5 9 )
      Transition ( 0 )
      Radius ( 80.0 )
      Angle ( 13.0 )

      )
    )
    )
   Light (
    comment( Headlight Top Centre )
     Type  ( 0 )
     Conditions (
     Headlight ( 3 )
     Unit ( 2 )
       )
     FadeIn ( 0.5 )
     FadeOut ( 0.5 )
     Cycle  ( 0 )
     States ( 1
     State (
      Duration ( 0.0 )
      LightColour ( FFFFFFFF )
      Position ( 0.01 3.853077 5.55 )
      Azimuth ( 0.0 -5.0 5.0 )
      Transition ( 0 )
      Radius ( 0.4 )
      Elevation ( -10 -10 -10 )
      )
    )
    )
   Light (
    comment( Sidelight Front Left)
     Type  ( 0 )
     Conditions (
     Headlight ( 3 )
     Unit ( 2 )
       )
     FadeIn ( 0.5 )
     FadeOut ( 0.5 )
     Cycle  ( 0 )
     States ( 1
     State (
      Duration ( 0.0 )
      LightColour ( FFFFFFFF )
      Position ( -1.05 2.47 5.5 )
      Azimuth ( -5 0.0 5 )
      Transition ( 0 )
      Radius ( 0.2 )
      Elevation ( -10 -10 -10 )
      )
    )
    )
   Light (
    comment( Sidelight  Front Right)
     Type  ( 0 )
     Conditions (
     Headlight ( 3 )
     Unit ( 2 )
       )
     FadeIn ( 0.5 )
     FadeOut ( 0.5 )
     Cycle  ( 0 )
     States ( 1
     State (
      Duration ( 0.0 )
      LightColour ( FFFFFFFF )
      Position ( 1.05 2.47 5.5 )
      Azimuth ( -5.0 0.0 5.0 )
      Transition ( 0 )
      Radius ( 0.2 )
      Elevation ( -10 -10 -10 )
      )
    )
    )
   )
  )

Engine ( CH_34043_CoombeMartin
    Effects
    (
        SteamSpecialEffects
        (
            SafetyValvesFX
            (
                0 4.133 -1.31
                0 1 0
                0.164663
            )
            WhistleFX
            (
                0 3.94 0.38
                0 1 0
                0.1269857
            )
            StackFX
            (
                0 4.0 3.9
                0 1 0
                0.25
            )
            CylindersFX
            (
                1.01 0.45 6.4
                0 0 1
                0.1
            )
            CylindersFX
            (
                -1.01 0.45 6.4
                0 0 1
                0.1
            )
 
        )
    )
 
     Wagon (CH_34043_CoombeMartin)
    IsTenderRequired( 1 )	
	Type ( Steam )
	MaxPower ( 1440kW )
	MaxForce ( 134KN )
	MaxVelocity ( 100mph )
    WheelRadius ( 0.94m )
    Sanding ( 1e9mph )
	NumWheels ( 6 )
	BoilerLength ( 6.2m )
	BoilerRadius ( 0.94m )
	BoilerVolume ( "323*(ft^3)" )
	BoilerEffectivity ( 1.05 )
	DraftingEffect ( 1.3 )
	BoilerResponsiveness ( 1 )
	CoalBurnage ( 10.6lb/hp/h )
	MaxBoilerOutput ( 34500lb/h )
	NumCylinders ( 3 )
	CylinderStroke ( 24in )
	CylinderDiameter ( 16.375in )
	CylinderVolume ( "8.77*(ft^3)" )
	CylinderEffectivity ( 4.2 )
	CutoffMaxForward( 0.70 )
 	CutoffMaxReverse( -0.70 )
 	SteamSmallestCutoff( 6.35 )
	InjectorSizes ( 11mm 11mm )
	ExhaustLimit ( 37000lb/h )
	PrimingFactor ( 1 )
  SteamPrimingPowerLossProportion ( 0.20 )
  SteamPrimingWaterUsageIncreaseProportion ( 0.25 )
  SteamPrimingInjectorsFailAtLevel ( 1.25 )
  SteamPrimingReductionWithCylinderCocksOpen ( 0.25 )
    BlastExponent ( 0.6 )
    MaxBoilerPressure ( 250psi )
    MaxFireMass ( 1800lb )
    IdealFireMass ( 1800lb )
    MaxWaterMass ( 4000lb )
    SafetyValvesSteamUsage ( 8000lb/h )
    ShovelCoalMass ( 15lb )
    SmokeCombustion ( 5 )
    MaxTenderCoalMass ( 11000lb )
    MaxTenderWaterMass ( 40000lb )
    InjectorTypes( 0 1 )
    SuperHeater ( 1.23 )
    SteamSmokeUnitsPerPoundOfFuel( 1 )
    SteamMaxSmokeUnitsReleaseRate( 20 )
    MaxSteamHeatingPressure( 50 )
    SafetyValvePressureDifference( 5 )
    SteamGaugeGlassHeight( 10 )
    SteamFiremanMaxConstantFiringRate ( 3300 )
    SteamFiremanMaxPossibleFiringRate ( 6000 )
 
    BasicSteamUsage ( 1200lb/h )
    BasicCoalUsage ( 200lb/h )
    InjectorLimits1 ( 50psi 0.5 1 )
    InjectorLimits2 ( 60psi 0.5 1 )
    CylinderCocksPowerEfficiency ( 0.9 )
    SteamCylinderCocksOperation ( Manual )
 
    VacuumBrakesSmallEjectorPowerRating ( 5.5 )
    VacuumBrakesMinBoilerPressureMaxVacuum ( 110 )
    VacuumBrakesSmallEjectorUsageRate ( 410 )
    VacuumBrakesLargeEjectorUsageRate ( 2400 )
    VacuumBrakesHasVacuumPump ( 0 )
 
    TrainBrakesControllerMaxReleaseRate (0.9 )
    TrainBrakesControllerMinSystemPressure ( 0 )
    TrainBrakesControllerMaxSystemPressure ( 21 )
 
    EngineBrakesControllerHasProportionalBrake ( 0 )
    EngineBrakesProportionalBrakeLag ( 0.9 )
 
    BrakesEngineBrakeType ( "Vacuum_single_pipe"  )
    BrakesTrainBrakeType ( "Vacuum_single_pipe" )
    BrakesEngineControllers( "Hand, Train" )
 
    SteamSmallestCutoff ( 6.3 )
    NumberOfDamperSteps ( 1 )
 
    RegulatorValveType ( Twin_port )
    RegulatorSecondValveStartPosition ( 0.5 )
    RegulatorPilotValveExponent ( 0.3 )
    RegulatorSecondValveExponent ( 1 )
    RegulatorPilotValveFullOpenning ( 0.5 )
    RegulatorMainValveInitialOpenning ( 0.55 )
 
    SteamBlowerEffectExponent ( 0.9 )
    SteamBlowerEfficiencyExponent ( 1.1 )
    SteamBlowerMaxSteamUsageRate( 500 ) comment( lbs/h )
    SteamBlowerMaxProportionOfBlastEffect ( 0.15 )
 
    SteamWaterScoopMinPickupSpeed( 25 ) comment( mph )
    SteamWaterScoopMaxPickupSpeed( 60 ) comment( mph )
    SteamWaterScoopResistance( 8500N )
    SteamWaterScoopMaxPickupRate ( 1000 )
 
    SteamSmokeUnitsPerPoundOfFuel ( 1 )

    CabView (BulliedWC.cvf)
    HeadOut (  -1.7 3.1 -5.5 )

        EngineControllers (

            Regulator ( 0 1 0.05 0
                NumNotches ( 0 )
            )
            Cutoff    ( -0.55 0.75 0.01 0
                NumNotches ( 0 )
            )
            Brake_Train ( 0 1 0.01 0.65
                NumNotches( 3
                    Notch( 0     1 TrainBrakesControllerReleaseStart )
                    Notch( 0.1   1 TrainBrakesControllerRunningStart )
                    Notch( 0.2   1 TrainBrakesControllerApplyStart )
                )
            )
            Brake_Hand ( 0 1 0.0125 0
                NumNotches ( 0 )
            )
            FireDoor ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2
                NumNotches ( 0 )
            )
            HeatingTap ( 0 1 0.025 0
                NumNotches ( 0 )
            )
            Shovel ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            DampersFront ( 0 1 0.1 1
                NumNotches ( 0 )
            )
            DampersBack ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector2Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )
Comment ( fire temp, fire mass, water mass, boiler pressure, water level, tender_water_mass, smoke_quantity, tender_coal_mass, fire_condition, coal quality) 
 
    EngineVariables(900 1600 3000 250 1 35000 200 1 1 0.7 )
        Sound ("..\\..\\common.sound\\Bullied_LightPacific\\blp-cab01.sms" )
        Name ( "CH_34043_CoombeMartin" )
    Description (
        "The description of the engine that the user will see.\n"+
        " \n"
    )
    EngineOperatingProcedures (
        " "To move forward\n"+\n"+
        " "1. Press the W key several times to move the Reverser to full Forward.\n"+\n"+
        " "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+\n"+
        " "3. Press the D key to increase the Regulator setting.\n"+  \n"+
        " "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+\n"+
        " "To slow the train\n"+\n"+
        " "1. Press the A key to move the Regulator to a lower setting.\n"+\n"+
        " "2. Use the brakes to further reduce speed if desired.\n\n"+\n"+
        " "To apply the train brakes\n"+\n"+
        " "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+\n"+
        " "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+\n"+
        " "To release the train brakes\n"+\n"+
        " "1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+\n"+
        " "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+\n"+
        " "To back up\n"+\n"+
        " "1. Bring your train to a full stop.\n"+ \n"+
        " "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+\n"+
        " "4. Press the ; (SEMICOLON) key to release the brakes.\n"+\n"+
        " "5. Slowly advance the regulator (D key).\n\n"+\n"+
        " "To load and unload passengers\n"+\n"+
        " "1. Stop at a station.\n"+\n"+
        " "2. Press the ENTER key.\n"+\n"+
        " "3. Wait for the \"permission to depart\" whistle.\n"+\n"+
        " "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+\n"+
        " "To couple to a car or locomotive\n"+\n"+
        " "1. Coast into the unit at a very slow speed, about 2 mph.\n"+\n"+
        " "TIP: To use the Coupling view, press the 6 key.\n"+\n"+
        " "2. Press F9 to open the Train Operations window.\n"+\n"+
        " "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+\n"+
        " "4. Close the Train Operations window.\n\n"+\n"+
        " "To uncouple from a car or locomotive\n"+\n"+
        " "1. Press F9 to open the Train Operations window.\n"+\n"+
        " "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+\n"+
        " "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+\n"+
        " "4. Close the Train Operations window.\n\n"+\n"+
        " "Firing commands (Automatic Fireman OFF in Options screen)\n"+\n"+
        " "To add coal to the firebox\n"+\n"+
        " "1. Press the F key to open the Firebox door.\n"+\n"+
        " "2. Press the R key to increase the shoveling rate.\n\n"+\n"+
        " "To stop adding coal to the fire\n"+\n"+
        " "1. Press SHIFT+R to decrease the shoveling rate.\n"+\n"+
        " "2. Press SHIFT+F to close the firebox door.\n\n"+\n"+
        " "To operate the blower\n"+\n"+
        " "1. Press the N key to increase the blower.\n"+\n"+
        " "2. Press SHIFT+N to decrease the blower.\n\n"+\n"+
        " "To operate the dampers\n"+\n"+
        " "1. Press the M key to open the dampers.\n"+\n"+
        " "2. Press SHIFT+M to close the dampers.\n\n"+\n"+
        " "To inject water into the boiler\n"+\n"+
        " "1. Press the I key to turn on the steam to Injector 1.\n"+\n"+
        " "(You can also press the O key to turn on the steam to Injector 2.)\n"+\n"+
        " "2. Press the K key to increase the water flow to Injector 1.\n"+\n"+
        " "(To increase the water flow to Injector 2, press the L key.)\n\n"+\n"+
        " "To stop boiler water injection\n"+ \n"+
        " "1. Press the I key to turn off the steam to Injector 1.\n"+\n"+
        " "2. Press the O key to turn off the steam to Injector 2."\n"+
        "\n"+
        " \n"
    )
)
